; ModuleID = 'module_llvm_module_linked_llvm_cpu_static.optimized.bc'
source_filename = "llvm_module_linked_llvm_cpu"
target datalayout = "e-m:e-p:32:32-i64:64-n32-S128"
target triple = "riscv32-pc-linux-elf"

%iree_hal_executable_library_header_t.8 = type { i32, ptr, i32, i32 }
%iree_hal_executable_dispatch_attrs_v0_t.9 = type { i16, i16 }
%iree_hal_executable_src_loc_v0_t.10 = type { i32, i32, ptr }
%iree_hal_executable_library_v0_t.14 = type { ptr, %iree_hal_executable_import_table_v0_t.11, %iree_hal_executable_export_table_v0_t.12, %iree_hal_executable_constant_table_v0_t.13 }
%iree_hal_executable_import_table_v0_t.11 = type { i32, ptr }
%iree_hal_executable_export_table_v0_t.12 = type { i32, ptr, ptr, ptr, ptr, ptr }
%iree_hal_executable_constant_table_v0_t.13 = type { i32 }
%struct.exp2f_data.15 = type { [32 x i32], double, [3 x double], double, double, [3 x double] }
%struct.powf_log2_data.17 = type { [16 x %struct.anon.16], [5 x double] }
%struct.anon.16 = type { double, double }
%iree_hal_executable_dispatch_state_v0_t.18 = type { i32, i32, i16, i16, i32, i32, i16, i8, i8, ptr, ptr, ptr }

@0 = internal constant [28 x i8] c"llvm_module_linked_llvm_cpu\00", align 1
@llvm_module_linked_llvm_cpu_library_query_v0_header = internal constant %iree_hal_executable_library_header_t.8 { i32 3, ptr @0, i32 0, i32 0 }

!0 = !{i32 2, !"Debug Info Version", i32 3}
!1 = !{i32 1, !"wchar_size", i32 4}
!2 = distinct !DICompileUnit(language: DW_LANG_C17, file: !3, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!3 = !DIFile(filename: "-", directory: "")
!4 = distinct !DISubprogram(name: "main_dispatch_0_generic_2_i8xf32", linkageName: "main_dispatch_0_generic_2_i8xf32", scope: !3, file: !3, line: 1, type: !5, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!5 = !DISubroutineType(cc: DW_CC_normal, types: !6)
!6 = !{!7, !8, !39, !68}
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_environment_v0_t", baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_environment_v0_t", scope: !12, file: !12, line: 246, size: 768, elements: !13)
!12 = !DIFile(filename: "runtime/src/iree/hal/local/executable_library.h", directory: ".")
!13 = !{!14, !22, !25, !28, !30}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_array_type, scope: !12, file: !12, line: 227, baseType: !18, size: 2048, elements: !20)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", baseType: !19)
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !{!21}
!21 = !DISubrange(count: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "import_thunk", baseType: !23, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIBasicType(name: "void", encoding: DW_ATE_address)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "import_funcs", baseType: !26, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "import_contexts", baseType: !29, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "processor", baseType: !31, offset: 128)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_processor_v0_t", scope: !12, file: !12, line: 227, size: 512, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_array_type, scope: !12, file: !12, line: 227, baseType: !35, size: 512, elements: !37)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", baseType: !36)
!36 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !{!38}
!38 = !DISubrange(count: 8)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_dispatch_state_v0_t", baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_dispatch_state_v0_t", scope: !12, file: !12, line: 275, size: 384, elements: !43)
!43 = !{!44, !45, !46, !49, !50, !51, !52, !53, !56, !57, !58, !63}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_x", baseType: !18, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_y", baseType: !18, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_z", baseType: !47, size: 16, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "push_constant_count", baseType: !47, size: 16, offset: 80)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_x", baseType: !18, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_y", baseType: !18, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_z", baseType: !47, size: 16, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", baseType: !54, size: 8, offset: 176)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "binding_count", baseType: !54, size: 8, offset: 184)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "push_constants", baseType: !15, size: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "binding_ptrs", baseType: !59, size: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, scope: !12, file: !12, line: 227, baseType: !62, size: 2048, elements: !20)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "binding_lengths", baseType: !64, size: 32, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, scope: !12, file: !12, line: 227, baseType: !67, size: 2048, elements: !20)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", baseType: !18)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_workgroup_state_v0_t", baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_workgroup_state_v0_t", scope: !12, file: !12, line: 321, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_x", baseType: !18, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_y", baseType: !18, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_z", baseType: !47, size: 16, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", baseType: !47, size: 16, offset: 80)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", baseType: !18, size: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", baseType: !23, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory_size", baseType: !18, size: 32, offset: 160)
!80 = distinct !DISubprogram(name: "main_dispatch_1_softmax_2xf32", linkageName: "main_dispatch_1_softmax_2xf32", scope: !3, file: !3, line: 1, type: !5, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!81 = distinct !DISubprogram(name: "main_dispatch_2_generic_2_f32xi8", linkageName: "main_dispatch_2_generic_2_f32xi8", scope: !3, file: !3, line: 1, type: !5, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!82 = !{!83, !83, i64 0}
!83 = !{!"short", !84, i64 0}
!84 = !{!"omnipotent char", !85, i64 0}
!85 = !{!"Simple C/C++ TBAA"}
!86 = !{!87, !87, i64 0}
!87 = !{!"float", !84, i64 0}
!88 = !{!"branch_weights", i32 2000, i32 1}
!89 = !{!"branch_weights", i32 1, i32 2000}
!90 = !{!"branch_weights", i32 -2147483648, i32 0}
